Microchip-MPLAB-Harmony/csp/apps/ccl/manchester_encoder/firmware/src/packs/ATSAMC21N18A_DFP/component/sdadc.h
/**
 * \brief Component description for SDADC
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-06-04T17:30:49Z */
#ifndef _SAMC21_SDADC_COMPONENT_H_
#define _SAMC21_SDADC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SDADC                                        */
/* ************************************************************************** */

/* -------- SDADC_CTRLA : (SDADC Offset: 0x00) (R/W 8) Control A -------- */
#define SDADC_CTRLA_RESETVALUE                _U_(0x00)                                            /**<  (SDADC_CTRLA) Control A  Reset Value */

#define SDADC_CTRLA_SWRST_Pos                 _U_(0)                                               /**< (SDADC_CTRLA) Software Reset Position */
#define SDADC_CTRLA_SWRST_Msk                 (_U_(0x1) << SDADC_CTRLA_SWRST_Pos)                  /**< (SDADC_CTRLA) Software Reset Mask */
#define SDADC_CTRLA_SWRST(value)              (SDADC_CTRLA_SWRST_Msk & ((value) << SDADC_CTRLA_SWRST_Pos))
#define SDADC_CTRLA_ENABLE_Pos                _U_(1)                                               /**< (SDADC_CTRLA) Enable Position */
#define SDADC_CTRLA_ENABLE_Msk                (_U_(0x1) << SDADC_CTRLA_ENABLE_Pos)                 /**< (SDADC_CTRLA) Enable Mask */
#define SDADC_CTRLA_ENABLE(value)             (SDADC_CTRLA_ENABLE_Msk & ((value) << SDADC_CTRLA_ENABLE_Pos))
#define SDADC_CTRLA_RUNSTDBY_Pos              _U_(6)                                               /**< (SDADC_CTRLA) Run during Standby Position */
#define SDADC_CTRLA_RUNSTDBY_Msk              (_U_(0x1) << SDADC_CTRLA_RUNSTDBY_Pos)               /**< (SDADC_CTRLA) Run during Standby Mask */
#define SDADC_CTRLA_RUNSTDBY(value)           (SDADC_CTRLA_RUNSTDBY_Msk & ((value) << SDADC_CTRLA_RUNSTDBY_Pos))
#define SDADC_CTRLA_ONDEMAND_Pos              _U_(7)                                               /**< (SDADC_CTRLA) On Demand Control Position */
#define SDADC_CTRLA_ONDEMAND_Msk              (_U_(0x1) << SDADC_CTRLA_ONDEMAND_Pos)               /**< (SDADC_CTRLA) On Demand Control Mask */
#define SDADC_CTRLA_ONDEMAND(value)           (SDADC_CTRLA_ONDEMAND_Msk & ((value) << SDADC_CTRLA_ONDEMAND_Pos))
#define SDADC_CTRLA_Msk                       _U_(0xC3)                                            /**< (SDADC_CTRLA) Register Mask  */


/* -------- SDADC_REFCTRL : (SDADC Offset: 0x01) (R/W 8) Reference Control -------- */
#define SDADC_REFCTRL_RESETVALUE              _U_(0x00)                                            /**<  (SDADC_REFCTRL) Reference Control  Reset Value */

#define SDADC_REFCTRL_REFSEL_Pos              _U_(0)                                               /**< (SDADC_REFCTRL) Reference Selection Position */
#define SDADC_REFCTRL_REFSEL_Msk              (_U_(0x3) << SDADC_REFCTRL_REFSEL_Pos)               /**< (SDADC_REFCTRL) Reference Selection Mask */
#define SDADC_REFCTRL_REFSEL(value)           (SDADC_REFCTRL_REFSEL_Msk & ((value) << SDADC_REFCTRL_REFSEL_Pos))
#define   SDADC_REFCTRL_REFSEL_INTREF_Val     _U_(0x0)                                             /**< (SDADC_REFCTRL) Internal Bandgap Reference  */
#define   SDADC_REFCTRL_REFSEL_AREFB_Val      _U_(0x1)                                             /**< (SDADC_REFCTRL) External Reference  */
#define   SDADC_REFCTRL_REFSEL_DAC_Val        _U_(0x2)                                             /**< (SDADC_REFCTRL) Internal DAC Output  */
#define   SDADC_REFCTRL_REFSEL_INTVCC_Val     _U_(0x3)                                             /**< (SDADC_REFCTRL) VDDANA  */
#define SDADC_REFCTRL_REFSEL_INTREF           (SDADC_REFCTRL_REFSEL_INTREF_Val << SDADC_REFCTRL_REFSEL_Pos) /**< (SDADC_REFCTRL) Internal Bandgap Reference Position  */
#define SDADC_REFCTRL_REFSEL_AREFB            (SDADC_REFCTRL_REFSEL_AREFB_Val << SDADC_REFCTRL_REFSEL_Pos) /**< (SDADC_REFCTRL) External Reference Position  */
#define SDADC_REFCTRL_REFSEL_DAC              (SDADC_REFCTRL_REFSEL_DAC_Val << SDADC_REFCTRL_REFSEL_Pos) /**< (SDADC_REFCTRL) Internal DAC Output Position  */
#define SDADC_REFCTRL_REFSEL_INTVCC           (SDADC_REFCTRL_REFSEL_INTVCC_Val << SDADC_REFCTRL_REFSEL_Pos) /**< (SDADC_REFCTRL) VDDANA Position  */
#define SDADC_REFCTRL_REFRANGE_Pos            _U_(4)                                               /**< (SDADC_REFCTRL) Reference Range Position */
#define SDADC_REFCTRL_REFRANGE_Msk            (_U_(0x3) << SDADC_REFCTRL_REFRANGE_Pos)             /**< (SDADC_REFCTRL) Reference Range Mask */
#define SDADC_REFCTRL_REFRANGE(value)         (SDADC_REFCTRL_REFRANGE_Msk & ((value) << SDADC_REFCTRL_REFRANGE_Pos))
#define SDADC_REFCTRL_ONREFBUF_Pos            _U_(7)                                               /**< (SDADC_REFCTRL) Reference Buffer Position */
#define SDADC_REFCTRL_ONREFBUF_Msk            (_U_(0x1) << SDADC_REFCTRL_ONREFBUF_Pos)             /**< (SDADC_REFCTRL) Reference Buffer Mask */
#define SDADC_REFCTRL_ONREFBUF(value)         (SDADC_REFCTRL_ONREFBUF_Msk & ((value) << SDADC_REFCTRL_ONREFBUF_Pos))
#define SDADC_REFCTRL_Msk                     _U_(0xB3)                                            /**< (SDADC_REFCTRL) Register Mask  */


/* -------- SDADC_CTRLB : (SDADC Offset: 0x02) (R/W 16) Control B -------- */
#define SDADC_CTRLB_RESETVALUE                _U_(0x2000)                                          /**<  (SDADC_CTRLB) Control B  Reset Value */

#define SDADC_CTRLB_PRESCALER_Pos             _U_(0)                                               /**< (SDADC_CTRLB) Prescaler Configuration Position */
#define SDADC_CTRLB_PRESCALER_Msk             (_U_(0xFF) << SDADC_CTRLB_PRESCALER_Pos)             /**< (SDADC_CTRLB) Prescaler Configuration Mask */
#define SDADC_CTRLB_PRESCALER(value)          (SDADC_CTRLB_PRESCALER_Msk & ((value) << SDADC_CTRLB_PRESCALER_Pos))
#define   SDADC_CTRLB_PRESCALER_DIV2_Val      _U_(0x0)                                             /**< (SDADC_CTRLB) Peripheral clock divided by 2  */
#define   SDADC_CTRLB_PRESCALER_DIV4_Val      _U_(0x1)                                             /**< (SDADC_CTRLB) Peripheral clock divided by 4  */
#define   SDADC_CTRLB_PRESCALER_DIV8_Val      _U_(0x2)                                             /**< (SDADC_CTRLB) Peripheral clock divided by 8  */
#define   SDADC_CTRLB_PRESCALER_DIV16_Val     _U_(0x3)                                             /**< (SDADC_CTRLB) Peripheral clock divided by 16  */
#define   SDADC_CTRLB_PRESCALER_DIV32_Val     _U_(0x4)                                             /**< (SDADC_CTRLB) Peripheral clock divided by 32  */
#define   SDADC_CTRLB_PRESCALER_DIV64_Val     _U_(0x5)                                             /**< (SDADC_CTRLB) Peripheral clock divided by 64  */
#define   SDADC_CTRLB_PRESCALER_DIV128_Val    _U_(0x6)                                             /**< (SDADC_CTRLB) Peripheral clock divided by 128  */
#define   SDADC_CTRLB_PRESCALER_DIV256_Val    _U_(0x7)                                             /**< (SDADC_CTRLB) Peripheral clock divided by 256  */
#define SDADC_CTRLB_PRESCALER_DIV2            (SDADC_CTRLB_PRESCALER_DIV2_Val << SDADC_CTRLB_PRESCALER_Pos) /**< (SDADC_CTRLB) Peripheral clock divided by 2 Position  */
#define SDADC_CTRLB_PRESCALER_DIV4            (SDADC_CTRLB_PRESCALER_DIV4_Val << SDADC_CTRLB_PRESCALER_Pos) /**< (SDADC_CTRLB) Peripheral clock divided by 4 Position  */
#define SDADC_CTRLB_PRESCALER_DIV8            (SDADC_CTRLB_PRESCALER_DIV8_Val << SDADC_CTRLB_PRESCALER_Pos) /**< (SDADC_CTRLB) Peripheral clock divided by 8 Position  */
#define SDADC_CTRLB_PRESCALER_DIV16           (SDADC_CTRLB_PRESCALER_DIV16_Val << SDADC_CTRLB_PRESCALER_Pos) /**< (SDADC_CTRLB) Peripheral clock divided by 16 Position  */
#define SDADC_CTRLB_PRESCALER_DIV32           (SDADC_CTRLB_PRESCALER_DIV32_Val << SDADC_CTRLB_PRESCALER_Pos) /**< (SDADC_CTRLB) Peripheral clock divided by 32 Position  */
#define SDADC_CTRLB_PRESCALER_DIV64           (SDADC_CTRLB_PRESCALER_DIV64_Val << SDADC_CTRLB_PRESCALER_Pos) /**< (SDADC_CTRLB) Peripheral clock divided by 64 Position  */
#define SDADC_CTRLB_PRESCALER_DIV128          (SDADC_CTRLB_PRESCALER_DIV128_Val << SDADC_CTRLB_PRESCALER_Pos) /**< (SDADC_CTRLB) Peripheral clock divided by 128 Position  */
#define SDADC_CTRLB_PRESCALER_DIV256          (SDADC_CTRLB_PRESCALER_DIV256_Val << SDADC_CTRLB_PRESCALER_Pos) /**< (SDADC_CTRLB) Peripheral clock divided by 256 Position  */
#define SDADC_CTRLB_OSR_Pos                   _U_(8)                                               /**< (SDADC_CTRLB) Over Sampling Ratio Position */
#define SDADC_CTRLB_OSR_Msk                   (_U_(0x7) << SDADC_CTRLB_OSR_Pos)                    /**< (SDADC_CTRLB) Over Sampling Ratio Mask */
#define SDADC_CTRLB_OSR(value)                (SDADC_CTRLB_OSR_Msk & ((value) << SDADC_CTRLB_OSR_Pos))
#define   SDADC_CTRLB_OSR_OSR64_Val           _U_(0x0)                                             /**< (SDADC_CTRLB) Over Sampling Ratio is 64  */
#define   SDADC_CTRLB_OSR_OSR128_Val          _U_(0x1)                                             /**< (SDADC_CTRLB) Over Sampling Ratio is 128  */
#define   SDADC_CTRLB_OSR_OSR256_Val          _U_(0x2)                                             /**< (SDADC_CTRLB) Over Sampling Ratio is 256  */
#define   SDADC_CTRLB_OSR_OSR512_Val          _U_(0x3)                                             /**< (SDADC_CTRLB) Over Sampling Ratio is 512  */
#define   SDADC_CTRLB_OSR_OSR1024_Val         _U_(0x4)                                             /**< (SDADC_CTRLB) Over Sampling Ratio is 1024  */
#define SDADC_CTRLB_OSR_OSR64                 (SDADC_CTRLB_OSR_OSR64_Val << SDADC_CTRLB_OSR_Pos)   /**< (SDADC_CTRLB) Over Sampling Ratio is 64 Position  */
#define SDADC_CTRLB_OSR_OSR128                (SDADC_CTRLB_OSR_OSR128_Val << SDADC_CTRLB_OSR_Pos)  /**< (SDADC_CTRLB) Over Sampling Ratio is 128 Position  */
#define SDADC_CTRLB_OSR_OSR256                (SDADC_CTRLB_OSR_OSR256_Val << SDADC_CTRLB_OSR_Pos)  /**< (SDADC_CTRLB) Over Sampling Ratio is 256 Position  */
#define SDADC_CTRLB_OSR_OSR512                (SDADC_CTRLB_OSR_OSR512_Val << SDADC_CTRLB_OSR_Pos)  /**< (SDADC_CTRLB) Over Sampling Ratio is 512 Position  */
#define SDADC_CTRLB_OSR_OSR1024               (SDADC_CTRLB_OSR_OSR1024_Val << SDADC_CTRLB_OSR_Pos) /**< (SDADC_CTRLB) Over Sampling Ratio is 1024 Position  */
#define SDADC_CTRLB_SKPCNT_Pos                _U_(12)                                              /**< (SDADC_CTRLB) Skip Sample Count Position */
#define SDADC_CTRLB_SKPCNT_Msk                (_U_(0xF) << SDADC_CTRLB_SKPCNT_Pos)                 /**< (SDADC_CTRLB) Skip Sample Count Mask */
#define SDADC_CTRLB_SKPCNT(value)             (SDADC_CTRLB_SKPCNT_Msk & ((value) << SDADC_CTRLB_SKPCNT_Pos))
#define SDADC_CTRLB_Msk                       _U_(0xF7FF)                                          /**< (SDADC_CTRLB) Register Mask  */


